Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 8a7494c77ff9e1e533c773e48bcd0e1a9073b3e4
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17516429288

**Plan (last ~500 lines):**
```
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "policy"
          + value = "sync"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
    }

  # module.helm.helm_release.ingress-nginx will be created
  + resource "helm_release" "ingress-nginx" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "service":
                    "annotations":
                      "service.beta.kubernetes.io/aws-load-balancer-nlb-target-type": "ip"
                      "service.beta.kubernetes.io/aws-load-balancer-scheme": "internet-facing"
                      "service.beta.kubernetes.io/aws-load-balancer-subnets": "subnet-0f0118f0de201e28e,subnet-0113a820d0f67a882,subnet-00cc56c7d251cddd4"
                      "service.beta.kubernetes.io/aws-load-balancer-type": "nlb"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.1.6"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "settings.clusterEndpoint"
          + value = "https://8A5DFFA1060058C42BF25B1A2AC9DC59.gr7.us-east-1.eks.amazonaws.com"
        }
      + set {
          + name  = "settings.clusterName"
          + value = "cilium"
        }
      + set {
          + name  = "settings.interruptionQueue"
          + value = "Karpenter-cilium"
        }
    }

  # module.helm.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = true
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "prometheus":
                  "prometheusSpec":
                    "podMonitorNamespaceSelector": {}
                    "podMonitorSelector": {}
                    "podMonitorSelectorNilUsesHelmValues": false
                    "serviceMonitorNamespaceSelector": {}
                    "serviceMonitorSelector": {}
                    "serviceMonitorSelectorNilUsesHelmValues": false
            EOT,
        ]
      + verify                     = false
      + version                    = "65.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.kubernetes_service_account.aws_load_balancer_controller will be created
  + resource "kubernetes_service_account" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.helm.kubernetes_service_account.eks_ebs_csi_controller will be created
  + resource "kubernetes_service_account" "eks_ebs_csi_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "ebs-csi-controller-sa"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.helm.kubernetes_service_account.external_dns will be created
  + resource "kubernetes_service_account" "external_dns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.network.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.network.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + deletion_protection       = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "cilium"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + region                    = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # module.network.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id     = (known after apply)
      + name   = "cilium"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # module.network.helm_release.cilium will be created
  + resource "helm_release" "cilium" {
      + atomic                     = false
      + chart                      = "cilium"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy cilium"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cilium"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://helm.cilium.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.17.4"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "egressMasqueradeInterfaces"
          + value = "eth+"
        }
      + set {
          + name  = "endpointRoutes.enabled"
          + value = "true"
        }
      + set {
          + name  = "eni.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.metrics.enableOpenMetrics"
          + value = "true"
        }
      + set {
          + name  = "hubble.metrics.enabled[0]"
          + value = "dns"
        }
      + set {
          + name  = "hubble.metrics.enabled[1]"
          + value = "drop"
        }
      + set {
          + name  = "hubble.metrics.enabled[2]"
          + value = "tcp"
        }
      + set {
          + name  = "hubble.metrics.enabled[3]"
          + value = "flow"
        }
      + set {
          + name  = "hubble.metrics.enabled[4]"
          + value = "port-distribution"
        }
      + set {
          + name  = "hubble.metrics.enabled[5]"
          + value = "icmp"
        }
      + set {
          + name  = "hubble.metrics.enabled[6]"
          + value = "httpV2:exemplars=true;labelsContext=source_ip\\,source_namespace\\,source_workload\\,destination_ip\\,destination_namespace\\,destination_workload\\,traffic_direction"
        }
      + set {
          + name  = "hubble.metrics.serviceMonitor.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.relay.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.method"
          + value = "helm"
        }
      + set {
          + name  = "hubble.ui.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.className"
          + value = "nginx"
        }
      + set {
          + name  = "hubble.ui.ingress.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.hosts[0]"
          + value = (known after apply)
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].path"
          + value = "/"
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].pathType"
          + value = "Prefix"
        }
      + set {
          + name  = "ipam.mode"
          + value = "eni"
        }
      + set {
          + name  = "k8sServiceHost"
          + value = (known after apply)
        }
      + set {
          + name  = "k8sServicePort"
          + value = "443"
        }
      + set {
          + name  = "kubeProxyReplacement"
          + value = "true"
        }
      + set {
          + name  = "operator.prometheus.enabled"
          + value = "true"
        }
      + set {
          + name  = "operator.prometheus.serviceMonitor.enabled"
          + value = "true"
        }
      + set {
          + name  = "prometheus.enabled"
          + value = "true"
        }
      + set {
          + name  = "prometheus.serviceMonitor.enabled"
          + value = "true"
        }
      + set {
          + name  = "routingMode"
          + value = "native"
        }
    }

  # module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0] is tainted, so must be replaced
+/- resource "aws_autoscaling_group" "this" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:326878231051:autoScalingGroup:a6dd5c95-3d9e-4283-baf7-e6adce4b3f81:autoScalingGroupName/karpenter-20250906155732906900000014" -> (known after apply)
      ~ availability_zones               = [
          - "us-east-1a",
          - "us-east-1b",
          - "us-east-1c",
        ] -> (known after apply)
      - capacity_rebalance               = false -> null
      ~ default_cooldown                 = 300 -> (known after apply)
      - default_instance_warmup          = 0 -> null
      - enabled_metrics                  = [] -> null
      ~ health_check_type                = "EC2" -> (known after apply)
      ~ id                               = "karpenter-20250906155732906900000014" -> (known after apply)
      ~ load_balancers                   = [] -> (known after apply)
      - max_instance_lifetime            = 0 -> null
      ~ name                             = "karpenter-20250906155732906900000014" -> (known after apply)
      ~ predicted_capacity               = 0 -> (known after apply)
      ~ service_linked_role_arn          = "arn:aws:iam::326878231051:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - suspended_processes              = [] -> null
      ~ target_group_arns                = [] -> (known after apply)
      ~ warm_pool_size                   = 0 -> (known after apply)
        # (14 unchanged attributes hidden)

      - availability_zone_distribution {
          - capacity_distribution_strategy = "balanced-best-effort" -> null
        }

      - capacity_reservation_specification {
          - capacity_reservation_preference = "default" -> null
        }

      ~ instance_refresh {
          - triggers = [] -> null
            # (1 unchanged attribute hidden)

          ~ preferences {
              - auto_rollback                = false -> null
              - checkpoint_percentages       = [] -> null
                # (5 unchanged attributes hidden)
            }
        }

      ~ launch_template {
            id      = "lt-0ba4b984872c94c21"
          ~ name    = "karpenter-20250906155726920000000012" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (7 unchanged blocks hidden)
    }

Plan: 23 to add, 0 to change, 1 to destroy.

Warning: Deprecated attribute

  on module-apps/helm.tf line 24, in resource "helm_release" "aws_load_balancer_controller":
  24:     value = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 14 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
